[
  {
    "titolo": "boh",
    "durata": 30.0,
    "data": "2016-08-30 14:20:25",
    "linea": "1"
  },
  {
    "titolo": "Cosa non è ESC",
    "autore": "Ubi",
    "abstract": "Nulla di più di quello che è scritto",
    "giorno": "1",
    "orario": "12:00:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T71",
    "data": "2016-09-01 12:00:00"
  },
  {
    "titolo": "Standard OWASP TOP 10",
    "autore": "Pawel (okno) Zorzan",
    "abstract": "Breve introduzione relativa ai principali concetti della Cyber Security. Analisi delle principali vulnerabilità secondo standard OWASP e case history relativi.",
    "giorno": "1",
    "orario": "12:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T6",
    "data": "2016-09-01 12:30:00"
  },
  {
    "titolo": "IPFIRE The Open Source Firewall Distribution",
    "autore": "Fabio Carletti aka Ryuw",
    "abstract": "Il mio talk si basa sul presentare questa distro Linux \"forkata\"(italian grappa mandolino arp-sp) da ipcop orientata all'ambito firewall con una serie di accortezze degne di essere prese in considerazione.\nNel talk che propongo si toccherà anche software plug-in annessi a questa distro gestibili liberamente e molto semplicemente da interfaccia grafica web quali hostapd,squid,snort e la patch grsecurity inclusa di base nel kernel di questa distro che fanno si di avere una distro degna di utilizzo router firewall ma anche router wifi attraverso hostapd e con la gestione del traffico di squid e IDS\\/IPS di snort.\nIl talk è di stampo di divulgazione di questa distro che è molto seguita dalla comunità e rilascia con costanza gli aggiornamenti.Oltre ad un accenno alla filosofia linux e GPL e indicato i punti di forza della distro saranno presentate schermate dell'interfacciaweb e plug-in aggiuntivi installabili e facilmente gestibili quali tor,clamav,htop..ecc\n\nQualche parola sarà spesa per la comunità di ipfire molto attiva e del costante aggiornamento di sviluppatori e di guide e il libro online della distro e di pakfire il gestore di pacchetti della distro e delle architetture supportate per improntare access point wifi.\nIl talk è adatto anche agli utenti alle prime armi dato che vorrei presentare e pubblicizzare questa ottima soluzione che uso oltre che in casa anche per uso lavorativo.",
    "giorno": "1",
    "orario": "14:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T41",
    "data": "2016-09-01 14:30:00"
  },
  {
    "titolo": "Ricostruzione forense di NTFS con metadati parzialmente danneggiati",
    "autore": "Andrea Lazzarotto (Lazza)",
    "abstract": "NTFS è uno dei file system più diffusi, essendo usato di default dai sistemi Windows e anche negli hard disk esterni ad alta capacità. Quando accade un danno hardware o software, può verificarsi la corruzione di una o più partizioni le quali diventano illeggibili.\nVerranno discusse alcune tecniche di ricostruzione efficaci anche in presenza di metadati danneggiati. L'attenzione verterà in particolare su NTFS e su RecuperaBit, un software creato dal relatore per implementare la ricostruzione forense di NTFS.",
    "giorno": "1",
    "orario": "15:00:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T64",
    "data": "2016-09-01 15:00:00"
  },
  {
    "titolo": "Acquisizione forense di contenuti web",
    "autore": "Marco Alvise De Stefani",
    "abstract": "Come acquisire in modalità forense un contenuto web, in modo da poterne dimostrare l'esistenza anche dopo l'eventuale cancellazione?\nLo vedremo con strumenti open source e con un nuovo tool tutto italiano: LegalEYE.",
    "giorno": "1",
    "orario": "15:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T55",
    "data": "2016-09-01 15:30:00"
  },
  {
    "titolo": "KiCAD: Come progettare il tuo primo circuito",
    "autore": "Aljaž Srebrnič",
    "abstract": "Hai un’idea che di piacerebbe realizzare? Magari comprende un circuito elettrico? Hai provato a vedere cosa si usa e la tua carta di credito è impallidita davanti ad Altium? Ho buone notizie! Con KiCAD, un software FLOSS per la progettazione di circuiti elettrici puoi realizzare schede anche piuttosto complesse senza (troppe) difficoltà.\nUn talk interattivo, vedremo come funziona KiCAD e proveremo insieme a progettare un semplice circuito.",
    "giorno": "1",
    "orario": "17:20:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T11",
    "data": "2016-09-01 17:20:00"
  },
  {
    "titolo": "Costruire interfacce avanzate uomo macchina: l'hardware",
    "autore": "Davide Caminati",
    "abstract": "Cosa è e come funziona la computer vision? Riassunto di 2 anni di esperimenti sulla visione artificiale, in particolare parlerò dell'hardware con miglior rapporto qualità prezzo per fare analisi in tempo reale di immagini, con approfondimenti sui metodi di riconoscimento di persone e facce fino ad arrivare ai metodi per identificare la posizione della pupilla (Eye Tracking) utile nel caso si vogliano costruire interfacce naturali (NI) uomo-macchina e presenterò un dispositivo di ausilio per la mobilità che utilizza computer vision. \nCome funziona il voice recognition? Oramai diamo per scontata la possibilità trasformare in comandi una frase detta al telefono o tablet, analizzeremo l'hardware (a basso costo) che ci permette di avere questa funzionalità per progetti offline (senza connessione internet) ed alcuni limiti del suo utilizzo.\nProgettare un impianto elettrico “domotico”, dove partire e cosa scegliere per realizzare una casa più SMART e confortevole. La mia esperienza dopo 2 anni di domotica self-made; ovvero come imparare dai propri errori e godere delle piccole gioie dell'automazione.",
    "giorno": "1",
    "orario": "17:50:00",
    "durata": "45",
    "linea": "1",
    "lingua": "IT",
    "uid": "T25",
    "data": "2016-09-01 17:50:00"
  },
  {
    "titolo": "Open source e alternanza scuola lavoro",
    "autore": "Matteo Serafini",
    "abstract": "Insegnare ai ragazzi delle scuole Superiori (dalle Terze alle Quinte) a considerare il Free Software e l'Open Source come opportunità di lavoro e crescita professionale mostrando come nelle varie branche dell'informatica questo software sia pesantemente presente. Inoltre Aiutarli a considerare quale tipologia di percorso seguire nell'ambito delle professioni informatiche. Da quest'anno le scuole hanno la necessita di far fare ai ragazzi dalle terze in su 200 ore complessive nel triennio tra tirocini, esperienze e corsi nel mondo del lavoro. Questo progetto partito con le scuole superiori di Mestre è stato avviato e iniziato con già due istituti superiori ed è in valutazione con altri istituti. E' un'ottima occasione per le varie associazioni di farsi conoscere e di collaborare tra loro e con le scuole del proprio territorio per promuoversi e promuove il movimento del Software Libero.",
    "giorno": "2",
    "orario": "10:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T42",
    "data": "2016-09-02 10:30:00"
  },
  {
    "titolo": "From Arbitrary File Write to Code Execution on Mac OS X",
    "autore": "Filippo Cavallarin",
    "abstract": "Cosa succede quando un bug in un programma ci permette di scrivere file in una locazione arbitraria nella home di un utente? La quarantena dei file di MacOSX è sufficiente a prevenire l'esecuzione di codice arbitrario?\nIn questo talk verrà presentato un metodo per bypassare il sistema di quarantena ed eseguire qualsiasi file anche non eseguibe (chmod -x)",
    "giorno": "2",
    "orario": "11:00:00",
    "durata": "60",
    "linea": "1",
    "lingua": "IT",
    "uid": "T33",
    "data": "2016-09-02 11:00:00"
  },
  {
    "titolo": "American Business: The Dark Side of Legal Security; The American Way",
    "autore": "Chris Magistrado",
    "abstract": "Diverting Corporate Liability with Security (a RIQ story). From automated DMCA emails to contacting copyright infringer's ISPs. Banks minimizing the liability and risk of phishing\\/scamming related court cases",
    "giorno": "2",
    "orario": "12:15:00",
    "durata": "45",
    "linea": "1",
    "lingua": "EN",
    "uid": "T17",
    "data": "2016-09-02 12:15:00"
  },
  {
    "titolo": "Buildroot e QT5 su dispositivi embedded",
    "autore": "Giovanni Marchetto",
    "abstract": "In questo talk andremmo ad analizzare le potenzialità messe a disposizione da Buildroot unito alla versatilità di QT5 su una board prodotta dalla ACMESYSTEMS denominata ACQUA A5",
    "giorno": "2",
    "orario": "14:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T50",
    "data": "2016-09-02 14:30:00"
  },
  {
    "titolo": "Frosted: un sistema operativo libero per IoT",
    "autore": "Daniele Lacamera",
    "abstract": "- motivazioni del progetto\n- descrizione dell'approccio (separazione kernel\\/user, license, librerie, applicazioni)\n- stato + issue aperte\n- collaborazione con altri progetti (libopencm3, mongoose, ecc.)\n- community guidelines\n",
    "giorno": "2",
    "orario": "15:00:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T2",
    "data": "2016-09-02 15:00:00"
  },
  {
    "titolo": "WISP: cosa è successo negli ultimi 15 anni",
    "autore": "Michele PHCV Pietravalle",
    "abstract": "L’evoluzione dei WISP, dalle autorizzazioni sperimentali ai giorni nostri.\nCosa è accaduto negli ultimi 15 anni nella banda dei 2,4 e dei 5GHz?\nDa quattro gatti con apparati poco più che autocostruiti alla giungla attuale, come ci si  evoluti?\nin che direzione si sta andando? in che direzione il ministero vuole andare?\n",
    "giorno": "2",
    "orario": "15:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T46",
    "data": "2016-09-02 15:30:00"
  },
  {
    "titolo": "Analisi mobile, come cambia nel corso del tempo, dalla RS-232 ai trojan",
    "autore": "Andrea Ghirardini (Pila)",
    "abstract": "In principio fu l'open source, poi arrivarono gli apparecchi come UFED, ora con gli smartphone, la crittografia pervasiva e il cloud sono necessari nuovi strumenti e approcci",
    "giorno": "2",
    "orario": "16:20:00",
    "durata": "45",
    "linea": "1",
    "lingua": "IT",
    "uid": "T15",
    "data": "2016-09-02 16:20:00"
  },
  {
    "titolo": "Mozilla SOS - a community support for securing open source software",
    "autore": "Vecna",
    "abstract": "\nMozilla vuole rendere l'ecosistema del software libero più sicuro, per questo ha dei fondi utilizzabili per revisione del codice di progetti esterni, si chiama SOS (Security Open Source). E' il source code audit il modo migliore con il quale si possono usare questi fondi? nei 18 minuti del CAPS, spiegherò qual'è il piano per quest'anna e cosa potrebbe succedere ne prossimi.",
    "giorno": "2",
    "orario": "17:05:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T30",
    "data": "2016-09-02 17:05:00"
  },
  {
    "titolo": "Costruire interfacce avanzate uomo macchina: il software",
    "autore": "Davide Caminati",
    "abstract": "Mostrerò alcuni programmi per riconoscimento facciale, riconoscimento caratteri da testo scritto a mano e image matching, darò particolare spazio al riconoscimento oculare ed al suo utilizzo sia in ambito pubblicitario\\/interfaccia utente, che nella realizzazione di ausili per disabili.\nCome scrivere un software che risponda a comandi vocali? Utilizzando hardware a basso costo, mostrerò come sia semplice impartire comandi vocali utilizzando pochissime righe di codice e parlerò delle tecniche più utilizzate per fare riconoscimento vocale.\nDomotica di ieri e di oggi, soluzioni commerciali e soluzioni hackare, parlerò della mia esperienza di “pigro” utilizzatore e di come possa essere riconsiderata anche in chiave di maggior benessere per le persone disabili.",
    "giorno": "2",
    "orario": "17:35:00",
    "durata": "45",
    "linea": "1",
    "lingua": "IT",
    "uid": "T27",
    "data": "2016-09-02 17:35:00"
  },
  {
    "titolo": "Node.js... parliamo di sicurezza, configurazioni e scrittura di codice sicuro",
    "autore": "Umberto Rosini \\/ UmbRos",
    "abstract": "Ci immergeremo nel mondo node.js esaminando vari metodi di attacco ad applicazioni javascript e su come difendersi attraverso configurazioni e scrittura di codice sicuro.",
    "giorno": "3",
    "orario": "09:45:00",
    "durata": "45",
    "linea": "1",
    "lingua": "IT",
    "uid": "T51",
    "data": "2016-09-03 09:45:00"
  },
  {
    "titolo": "Recuperare la password di Windows in pausa caffè",
    "autore": "Litiano Piccin (KWH)",
    "abstract": "Stamattina devo fare un'attività su un server ma non ho l'accesso. Però il collega che ci va spesso ora è alla macchinetta del caffè. Un po' di forensics magari mi può essere utile....",
    "giorno": "3",
    "orario": "10:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T63",
    "data": "2016-09-03 10:30:00"
  },
  {
    "titolo": "Costruire Ausili per disabili presentazione progetti",
    "autore": "Davide Caminati",
    "abstract": "Il mondo dell'hacking e la (mia) svolta sociale, cosa è stato fatto e cosa è possibile fare per mettere a frutto le competenze non comuni.\nSpunti di lavoro e presentazione di progetti realizzati con particolare approfondimento sul background e sul percorso che ha portato alla loro realizzazione.\nDispositivi che verranno presi in esame:\n- il puntatore oculare low cost (ausilio per sindrome locked-in)\n- il telecomando per abilitare l'audio descrittivo in televisione (ausilio per non vedernti)\n- il lettore per audiolibri e del sole 24 ORE (ausilio per non vedenti)\n- l'anello sfumacchione (ausilio per fumatori)\n- la biblioteca multimediale per 2 scuole in Malawi, Africa (progetto RACHEL)",
    "giorno": "3",
    "orario": "11:00:00",
    "durata": "45",
    "linea": "1",
    "lingua": "IT",
    "uid": "T28",
    "data": "2016-09-03 11:00:00"
  },
  {
    "titolo": "Face recognition: Ognuno ha la faccia che ha, ma qualcuno esagera.",
    "autore": "Antonio Barili (prof)",
    "abstract": "Strumenti e tecniche (e limiti) del riconoscimento volti da immagini.",
    "giorno": "3",
    "orario": "12:00:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T60",
    "data": "2016-09-03 12:00:00"
  },
  {
    "titolo": "The Internet of (other people's) things",
    "autore": "Marco d'Itri",
    "abstract": "Abstract in arrivo",
    "giorno": "3",
    "orario": "12:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T44",
    "data": "2016-09-03 12:30:00"
  },
  {
    "titolo": "I cambiamenti del traffico Internet in seguito all’evoluzione del mercato dello streaming audio e video",
    "autore": "Michele PHCV Pietravalle",
    "abstract": "Negli ultimi 3\\/4 si è assistito a dei sostanziali mutamenti nel settore dello streaming audio\\/video, grazie alla nascita di numerosi player. Che impatto è avvenuto e come è possibile verificarlo dall’analisi del traffico Internet? Quali le evoluzioni nel breve e lungo periodo?",
    "giorno": "3",
    "orario": "13:00:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T37",
    "data": "2016-09-03 13:00:00"
  },
  {
    "titolo": "Love your database",
    "autore": "Chris Mair",
    "abstract": "SQL still rules the town",
    "giorno": "3",
    "orario": "14:30:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T3",
    "data": "2016-09-03 14:30:00"
  },
  {
    "titolo": "Frosted in-depth: dallo sviluppo kernel al supporto per applicazioni e librerie POSIX",
    "autore": "Daniele Lacamera",
    "abstract": "Scrivere un sistema POSIX da zero puo` sembrare un'impresa difficile. La disponibilita` di specifiche accurate e manpages che spiegano il comportamento delle chiamate di sistema rende il tutto relativamente semplice.\nIn questo talk si cerchera` di analizzare i componenti centrali del sistema operativo (scheduler, gestione della memoria, interfacciamento con l'hardware) utilizzando un approccio top-down, cercando di capire cosa gli applicativi e le librerie si aspettano dal sistema  sottostante.\nSi discuteranno le scelte progettuali attraverso lo studio delle interfacce dei moduli, e infine si mostrera` la facilita` con cui il sistema puo` essere portato su altre piattaforme grazie alla flessibilita` dell'astrazione hardware fornita da unicore-mx.",
    "giorno": "3",
    "orario": "15:00:00",
    "durata": "60",
    "linea": "1",
    "lingua": "IT",
    "uid": "T12",
    "data": "2016-09-03 15:00:00"
  },
  {
    "titolo": "Quantum Machine Learning (for hackers)",
    "autore": "Alessandro Scinawa Luongo",
    "abstract": "What if I tell you that the fields of Machine Learning and the field of Quantum Computation are finally merging together?\nWhat if I tell you that one of its offsprings, an algorithm based on a biological model of memory, is capable of creative behavior?\nI promise many graphs and very little math.",
    "giorno": "3",
    "orario": "16:15:00",
    "durata": "45",
    "linea": "1",
    "lingua": "EN",
    "uid": "T49",
    "data": "2016-09-03 16:15:00"
  },
  {
    "titolo": "IPv6 Internet: the (very) hard way -  Teaser for the CAPS\n",
    "autore": "Daniele Iamartino",
    "abstract": "Qualche minuto di presentazione del CAPS \"IPv6 Internet: the (very) hard way\". ",
    "giorno": "3",
    "orario": "17:00:00",
    "durata": "30",
    "linea": "1",
    "lingua": "IT",
    "uid": "T61",
    "data": "2016-09-03 17:00:00"
  },
  {
    "titolo": "Dalla sicurezza informatica alla 'sicurezza cibernetica': l'inarrestabile avanzata degli Stati nel cyber-spazio",
    "autore": "Stefano Mele",
    "abstract": "Da quando nel 2010 William Lynn III, l'allora Vice Segretario della Difesa degli U.S., dichiarò pubblicamente il cyber-spazio come \"quinto dominio della conflittualità\", gli Stati hanno cominciato a guardare sempre di più ad Internet come un nuovo \"territorio\" attraverso cui svolgere operazioni militari e di spionaggio.\nL'intervento fa il punto della situazione e delinea gli scenari futuri.",
    "giorno": "3",
    "orario": "17:30:00",
    "durata": "60",
    "linea": "1",
    "lingua": "IT",
    "uid": "T29",
    "data": "2016-09-03 17:30:00"
  },
  {
    "titolo": "Presentazione vincitori CTF",
    "autore": "Swappage",
    "abstract": "Verrà illustrato il CTF 2K16 ed avverrà la premiazione dei vincitori.",
    "giorno": "4",
    "orario": "10:00:00",
    "durata": "60",
    "linea": "1",
    "lingua": "IT",
    "uid": "T68",
    "data": "2016-09-04 10:00:00"
  },
  {
    "titolo": "Cos'è ESC",
    "autore": "Sebastiano Mestre",
    "abstract": "Sebastiano, ideatore di End Summer Camp e promotore dell'associazione Italian GRAPPA, racconta cos'è ESC, gli ideali che si propone di trasmettere, i traguardi raggiunti e gli ostacoli da superare. ",
    "giorno": "4",
    "orario": "11:00:00",
    "durata": "42",
    "linea": "1",
    "lingua": "IT",
    "uid": "T66",
    "data": "2016-09-04 11:00:00"
  },
  {
    "titolo": "Assemblea ItalianGrappa",
    "autore": "ItalianGrappa",
    "abstract": "Assemblea Ordinaria dei soci di Italian GRAPPA. Segue la consueta Asta di fine ESC !",
    "giorno": "4",
    "orario": "11:42:00",
    "durata": "60",
    "linea": "1",
    "lingua": "IT",
    "uid": "T67",
    "data": "2016-09-04 11:42:00"
  },
  {
    "titolo": "Zanshin Tech: la prima arte marziale digitale",
    "autore": "Claudio Canavese (CoD)",
    "abstract": "Lo Zanshin Tech è un'arte marziale che fonde gli insegnamenti tradizionali delle arti marziali orientali (non violenza, rispetto dell'altro, serena concentrazione, disciplina) con tecniche base di cybersecurity e insegnamenti sull'uso (anche non convenzionale) delle tecnologie.\nLo scopo è quello di portare i praticanti (dagli 11 anni in su) allo stato di Zanshin (la vigilanza serena) durante l'uso delle tecnologie.\nSi applica con successo ad adulti e ragazzi e serve a contrastare molte aggressioni digitali come ad esempio cyberbullismo, adescamento, cyberstalking, cybermobbing, truffe online, ecc...",
    "giorno": "1",
    "orario": "14:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T54",
    "data": "2016-09-01 14:30:00"
  },
  {
    "titolo": "Caramelle dagli sconosciuti — ed altri buoni motivi per usare apt",
    "autore": "Elena \"of Valhalla'' Grandi",
    "abstract": "L'uso di piattaforme che permettono agli autori di software di distribuire direttamente i loro prodotti agli utenti, senza passare dai maintainer di una distribuzione, si diffonde sempre di più, ma è davvero una buona idea?",
    "giorno": "1",
    "orario": "15:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T38",
    "data": "2016-09-01 15:30:00"
  },
  {
    "titolo": "Understanding Hadoop framework and its ecosystem",
    "autore": "Mario Cartia",
    "abstract": "Hadoop è il framework open-source \"standard de facto\" per l'archiviazione ed il processamento distribuito di elevate quantità di dati. Il talk illustrerà il funzionamento del framework, i tools e le distribuzioni fornendo ai partecipanti una panoramica sullo stato dell'arte dell'ecosistema di strumenti e tecnologie per l'utilizzo dei Big Data.",
    "giorno": "1",
    "orario": "16:20:00",
    "durata": "45",
    "linea": "2",
    "lingua": "IT",
    "uid": "T59",
    "data": "2016-09-01 16:20:00"
  },
  {
    "titolo": "Steamy: quando scopri il controller che hai comprato e' solo un fermacarte.",
    "autore": "meh.",
    "abstract": "L'unica cosa che puoi fare e' reversarlo.\nEsposizione della prima esperienza di reversing di un device USB, tools usati e sviluppati, ragionamenti seguiti per capire il formato del protocollo, e finale antanizzazione di feature peculiari del controller.",
    "giorno": "1",
    "orario": "17:05:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T47",
    "data": "2016-09-01 17:05:00"
  },
  {
    "titolo": "Javascript Crypto in GlobaLeaks and other sins",
    "autore": "Synnick",
    "abstract": "This talk will focus on the new unstable release of GlobaLeaks and the cryptography and design that goes into it. The point is to protect sensitive data stored on a server that may be seized. Moving cryptography into the browser posses interesting challenges and new thinking!",
    "giorno": "1",
    "orario": "18:05:00",
    "durata": "30",
    "linea": "2",
    "lingua": "EN",
    "uid": "T70",
    "data": "2016-09-01 18:05:00"
  },
  {
    "titolo": "HTCAP Scan & Crawl the next generation",
    "autore": "Filippo Cavallarin",
    "abstract": "Cos'è e come funziona Htcap, esempi pratici di scanning e crawling su Single Page Applicazion intercettando chiamate Ajax e cambiamenti DOM.",
    "giorno": "1",
    "orario": "21:30:00",
    "durata": "60",
    "linea": "2",
    "lingua": "IT",
    "uid": "T32",
    "data": "2016-09-01 21:30:00"
  },
  {
    "titolo": "SUID insecurity, dove LD_PRELOAD non arriva: PA(TH)ZUZU!",
    "autore": "Roberto Shotokan Bindi",
    "abstract": "Presentazione di uno script per l'analisi ed exploiting delle vulnerabilità di tipo PATH spoofing, permettendo un'escalation all'utente proprietario del processo chiamato.",
    "giorno": "1",
    "orario": "22:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T31",
    "data": "2016-09-01 22:30:00"
  },
  {
    "titolo": "Buffer Overflow Attack",
    "autore": "Fabio FVZ",
    "abstract": "Analizziamo e vediamo uno degli attacchi piu' vecchi e forse ancora interessanti. \nAnalizziamo l'attacco, come e' possibile prevenirlo...OpenBSD...",
    "giorno": "1",
    "orario": "23:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T45",
    "data": "2016-09-01 23:00:00"
  },
  {
    "titolo": "Petya ransomware sotto i riflettori...",
    "autore": "Gianfranco Tonello",
    "abstract": "Durante il workshop verrà analizzato il funzionamente a basso livello di Petya:\n* Analisi delle 3 fasi di infezione di Petya (versione Red)\n* Algoritmo di cifratura implementato\n* Punti deboli di Petya (versione Red)\n* Come decifrare Petya (versione Red)\n* Analisi di Petya versione Green\n* Confronto delle versioni Red e Green di Petya\n* Punti deboli di Petya (versione Green)\n* Conclusioni",
    "giorno": "2",
    "orario": "10:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T57",
    "data": "2016-09-02 10:30:00"
  },
  {
    "titolo": "Interactive Digital Storytelling: dalla UX alle nuove prospettive",
    "autore": "Paulina Greta Stefanovic",
    "abstract": "La pervasività delle tecnologie interattive evolve il rapporto tra audience e autore. La user experience dello storytelling interattivo inquadra nuove opportunità e nuove responsabilità di cui autori, designers, makers e programmatori devono cominciare a tener conto.\nAttraverso esempi concreti di film webgl, giochi, installazioni, app si spiegheranno le caratteristiche principali di quelli che sono i nuovi sistemi di narrazione digitale interattiva dove il software stesso comincia ad assumere un ruolo diverso.\n",
    "giorno": "2",
    "orario": "11:00:00",
    "durata": "45",
    "linea": "2",
    "lingua": "iT",
    "uid": "T36",
    "data": "2016-09-02 11:00:00"
  },
  {
    "titolo": "ITIL e IT Security: un approccio \"sicuro\" al Service Management",
    "autore": "Nicolò Castoldi",
    "abstract": "- Cosa è e soprattutto cosa NON è ITIL\n- Aree cross (es. gestione degli incidenti, gestione degli accessi, user awareness, InfoSec Management...)\n- Come può supportare la security e le funzioni operative una trasofrmazione aziendale basata su ITIL\n- Gli incidenti non sono tutti uguali: ITIL vs NIST\n- Core points (un recap con gli elementi più importanti)",
    "giorno": "2",
    "orario": "12:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T58",
    "data": "2016-09-02 12:00:00"
  },
  {
    "titolo": "Open Source Intelligence e imprudenza dell'utente. Quello che la Rete sa di noi.",
    "autore": "Antonio Sagliocca \\/ Sanio",
    "abstract": "Assistiamo oggi ad una duplice tendenza che mette a rischio la nostra privacy e la nostra sicurezza in Rete. Da un lato la facilità con cui, senza pensarci a sufficienza, diffondiamo in internet sui vari Social, Blog e siti vari, informazioni che ci appartengono come se stessimo scrivendole su un nostro diario personale. Dall’altro grazie all'informatizzazione di banche dati pubbliche, alla tecnologia ed ai bug delle applicazioni, nonché alla negligenza di alcuni amministratori di rete, come sia facile per chiunque con un minimo di conoscenze informatiche reperire parecchie informazioni sul nostro conto, che una volta aggregate tra loro, costruiranno un vero e proprio profilo di noi.",
    "giorno": "2",
    "orario": "12:30:00",
    "durata": "60",
    "linea": "2",
    "lingua": "IT",
    "uid": "T22",
    "data": "2016-09-02 12:30:00"
  },
  {
    "titolo": "CANtact: An Open Tool for Automotive Exploitation",
    "autore": "Eric Evenchick",
    "abstract": "Controller Area Network (CAN) remains the leading protocol for networking automotive controllers. Access to CAN gives an attacker the  ability to modify system operation, perform diagnostic actions, and disable the system. CAN is also used in SCADA networks and industrial control systems.\nHistorically, software and hardware for CAN has been expensive and targeted at automotive OEMs. Last year, we launched CANtact, an open source hardware CAN bus tool for PCs. This provides a low cost solution for converting CAN to USB and getting on the bus.\nHowever, once connected to CAN, software is needed to make sense of traffic on the bus. CANtact is a new tool for this purpose. It allows the user to view CAN traffic, decode messages, and perform diagnostic actions in a graphical environment.\nExisting CAN software is focused on developing systems, CANtact is designed for breaking them. The tool has been designed with reverse engineering and fuzzing in mind.\nIn this talk, we'll introduce the CANtact software, provide details about its design, and explain how it can be used to perform analysis on CAN systems. We'll also look into some of the analysis techinques that are useful for reverse engineering CAN systems.",
    "giorno": "2",
    "orario": "14:30:00",
    "durata": "60",
    "linea": "2",
    "lingua": "EN",
    "uid": "T8",
    "data": "2016-09-02 14:30:00"
  },
  {
    "titolo": "The Fenrir Project: Why TLS sucks and what I'm doing about it",
    "autore": "Luca Fulchir",
    "abstract": "Fenrir is a new transport and encryption protocol based on federated authentication.\nThe protocol works on top of IP (UDP tunnelling available), and can manage multiple data streams, \nin any combination of (un)reliable, (un)ordered, bytestream or datagram data delivery, with\nmultiple layers of error corrections, and both unicast and multicast support.\n\nMultiple layers of authorizations can be configured and the authentication is token\nbased.\n\nAlthough it is a federated protocol, compromising the authentication server or even the\nchain of trust will not provide the attacker with enough data to access the user data.",
    "giorno": "2",
    "orario": "15:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "EN",
    "uid": "T19",
    "data": "2016-09-02 15:30:00"
  },
  {
    "titolo": "PHP (Hard)Core Exploitation",
    "autore": "Andrea Palazzo",
    "abstract": "The talk is a walkthrough of the PHP Core attack surface, which will be analyzed both from a vulnerability research and an exploit development perspective",
    "giorno": "2",
    "orario": "16:20:00",
    "durata": "60",
    "linea": "2",
    "lingua": "IT",
    "uid": "T14",
    "data": "2016-09-02 16:20:00"
  },
  {
    "titolo": "Anopticon: Psicologia del potere\nNon solo telecamere\n",
    "autore": "Epto",
    "abstract": "Dopo diverse inchieste sulla videosorveglianza, sul “Grande Fratello”, la censura e la repressione, siamo arrivati alla fase in cui è possibile fare il “reverse” del “Grande Fratello” e capire la psicologia del potere.\nPer quanto la psicologia non ci piaccia, intendiamo analizzare il “Grande Fratello” e soprattutto il “sistema” nel quale siamo stati introdotti come esseri umani in cattività, utilizzando l'approccio che il costruttivismo è in grado di darci, analizzando così il “Grande Fratello” e la “psicologia del potere” destrutturando la percezione stessa della realtà Orwelliana che ci circonda.\nQuesto ci aiuterà a comprendere la gravità de problemi presenti e futuri inerenti le conseguenze della sorveglianza e del potere dal punto di\nvista strutturale e concettuale. Oltre a tutto ciò saranno svelate le pulsioni inconsce che spingono il “Grande Fratello” ad essere tale come “essere inorganico” ma tuttavia presente nelle azioni delle persone che applicano l'esercizio del potere nelle nostre città.\nSaranno inoltre trattate le diverse metodologie per immunizzarsi dall'esercizio del “potere sottile” e così trasformarsi da “corpi docili” a “corpi opachi”.",
    "giorno": "2",
    "orario": "17:20:00",
    "durata": "60",
    "linea": "2",
    "lingua": "IT",
    "uid": "T34",
    "data": "2016-09-02 17:20:00"
  },
  {
    "titolo": "Making sense of a million samples per day: Behavior-based Methods for\nAutomated, Scalable Malware Analysis",
    "autore": "Stefano Zanero (Raistlin)",
    "abstract": "With the astonishing rate of new and modified malware samples being released daily, automation of analysis is needed to classify and cluster together similar samples, exclude basic and uninteresting variations, and focus costly manual analysis work on novel and interesting features (e.g., added or remove pieces of code with a given semantic). We will discuss the challenges in analyzing large malware datasets in a (semi)automatic fashion, and some recent research results that may help with the task, by leveraging the concept of \"behavior\" applied to malicious code.",
    "giorno": "2",
    "orario": "19:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "EN",
    "uid": "T65",
    "data": "2016-09-02 19:00:00"
  },
  {
    "titolo": "CryptoCurrencies: Are you in control of YOUR money?",
    "autore": "Chris Magistrado",
    "abstract": "Who controls your money? (Federal Reserve are Private Companies) Every and all transactions and lifestyles are recorded. What are the alternatives? Bitcoins is only pseudo-anonymous. There are many security companies watching all your moves with bitcoin. Solutions to keep anonymity with CryptoCurrencies: Dash. Segway into the power of seamlessly transferring and converting bitcoins into any altcoin.",
    "giorno": "2",
    "orario": "21:15:00",
    "durata": "60",
    "linea": "2",
    "lingua": "EN",
    "uid": "T7",
    "data": "2016-09-02 21:15:00"
  },
  {
    "titolo": "iOS Antiforensics",
    "autore": "Mattia Epifani",
    "abstract": "Guida pratica a come configurare il proprio dispositivo iOS per impedirne una analisi forense",
    "giorno": "2",
    "orario": "22:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T21",
    "data": "2016-09-02 22:30:00"
  },
  {
    "titolo": "Dump fisico di dispositivi Android",
    "autore": "Litiano Piccin (KWH)",
    "abstract": "Una delle problematiche che l'analista forense deve affrontare quando gli viene chiesta l'acquisizione di un dispositivo mobile con installato Android è la presenza o meno di passcode che possono inibire l'acquisizione stessa. Ad oggi, per diversi dispositivi è ancora possibile aggirare tale ostacolo andando ad eseguire un dump fisico della partizione contenente i dati utente.",
    "giorno": "2",
    "orario": "23:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T62",
    "data": "2016-09-02 23:00:00"
  },
  {
    "titolo": "Why are we speaking at sec-cons?",
    "autore": "Raoul Chiesa",
    "abstract": "A field analysis resulting from +20yrs of InfoSec-globe-trotting. You will finally understand what I've done over the last 20 years.",
    "giorno": "3",
    "orario": "00:00:00",
    "durata": "90",
    "linea": "2",
    "lingua": "IT",
    "uid": "T16",
    "data": "2016-09-03 00:00:00"
  },
  {
    "titolo": "Cosa non è ESC",
    "autore": "Ubi",
    "abstract": "Nulla di più di quello che è scritto",
    "giorno": "3",
    "orario": "10:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T72",
    "data": "2016-09-03 10:00:00"
  },
  {
    "titolo": "Cyber-resistence in 2016 consist into algorithm reversing and not into encrytpion anymore",
    "autore": "vecna",
    "abstract": "Preniamo in esempio una delle forme di potere più grandi e nuove di questo millenion: i social network che fan capo a Facebook (whatsapp, facebook, instagram). Sono monopolii che sfruttano una risorsa molto scarsa: la quantità di persone alle quali tieni.\nGli utenti hanno un incentivo ad andare nella rete più grossa, trovandoci più facilmente persone che conoscono.\nQuesto è un fenomeno che si auto alimenta e non ci sarà Nazione o policy che potrà regolamentarlo.\nMa nel contempo, sui grandi numeri, questi colossi possono influenzare come l'umanità viene informata, percepisce la vita circostante, e sapere in tempo reale chi sa cosa e perchè.\nPresenterò il mio piano per invertire questa tendenza\nnota: NON proporrò nuovi social network che nessuno usa, NON proporrò nuovi modelli di business, NON propongo leggi e neppure delle pratiche di disobbedienza civile contro i social network (anche se suonerebbe bene, non è ancora il momento).\nNON proporrò neppure roba crittografica, nonostante sia legittimo pensare che cifrare tutto nel dubbio serva sempre a qualcosa.\nkeyword: autodifesa digitale, tecnopolitica, daje ar monopolista, javascript.",
    "giorno": "3",
    "orario": "10:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "EN",
    "uid": "T69",
    "data": "2016-09-03 10:30:00"
  },
  {
    "titolo": "NOT WITH MY DATA: TRANSPARENCY vs ACCOUNTABILITY",
    "autore": "Matteo Flora - Alessandro Scinawa Luongo",
    "abstract": "Il problema del dato personale, tra profilazione e diritto all'oblio, ha radici tecnologiche e architetturali molto profonde. \nNegli ultimi anni i modelli di business di più grande successo si basano sui dati degli utenti: sulla raccolta, sull'incitazione alla condivisione, sulla creazione di valore del dato. Un mondo di aziende e servizi interamente basati sulla condivisione (ed analisi) di dati degli utenti.  \n\nIn questo talk faremo un esercizio collettivo di immaginazione: come dovrebbe essere l'architettura di internet per continuare a garantire la proprietà e la confidenzialità dei dati personali? Qual'è, se esiste, il limite di utilizzo dei dati personali per profilazione? E per Marketing? E per sicurezza nazionale? E per cronaca? Devo settiamo (se la vogliamo settare), la \"barra\" della liceità e della morale?\nPer immaginare business sostenibili che non abbiano la prerogativa di accedere pervasivamente ai dati degli utenti, è necessario sviluppare nuove soluzioni tecnologiche. Quali? Le identità multiple online sono una alternativa valida? \n\nQui alcune proposte, alcuni problemi, alcuni spunti per pensare, assieme, alle soluzioni del futuro.\n",
    "giorno": "3",
    "orario": "11:00:00",
    "durata": "45",
    "linea": "2",
    "lingua": "IT",
    "uid": "T20",
    "data": "2016-09-03 11:00:00"
  },
  {
    "titolo": "Supersized Bit - is 640K enough for everyone?",
    "autore": "Federico klez Culloca",
    "abstract": "Il programma Apollo ha mandato l'Uomo sulla Luna con un computer con 36K di RAM e 2K ROM. Oggi servono 4 core e 2GB di RAM per giocare a Candy Crush.\nCos'è andato storto? Possiamo far assumere al nostro software una dieta più equilibrata?",
    "giorno": "3",
    "orario": "12:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T10",
    "data": "2016-09-03 12:00:00"
  },
  {
    "titolo": "OnionMail: Server di posta su Tor",
    "autore": "Epto",
    "abstract": "Stato del progetto, statistiche e verso OnionMail due",
    "giorno": "3",
    "orario": "13:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T35",
    "data": "2016-09-03 13:00:00"
  },
  {
    "titolo": "PHP backdoor obfuscation: the rise of the vuln",
    "autore": "Sandro \"guly\" Zaccarini",
    "abstract": "Iniettare backdoor nel codice di siti web e' la strada piu' economica e nascosta per ottenere persistenza su una rete compromessa, sia che si vogliano mantenere alti privilegi sulla webapp sia che si vogliano eseguire comandi sul sistema sottostante.\nDurante questo talk parleremo del contesto di una backdoor, definendo l'ambiente nel quale questa nasce e cresce.\nSara' analizzato ogni aspetto ambientale: qual'e' il miglior punto di inoculazione, perche' scegliere una specifica funzione o trucco, che permessi sono necessari, come utilizzare la backdoor in maniera sicura, nascosta e riproducibile, e ovviamente cosa iniettare.\nPresenteremo poi diverse metodologie applicate a codice PHP, mostrando esempi di backdoor su plugin di CMS e webapp custom, alterando il codice e inquinando l'ecosistema della webapp stessa (leggi: DBMS e webserver).",
    "giorno": "3",
    "orario": "14:30:00",
    "durata": "60",
    "linea": "2",
    "lingua": "IT",
    "uid": "T1",
    "data": "2016-09-03 14:30:00"
  },
  {
    "titolo": "State-Sponsored Trojan: many innovations = many problems ",
    "autore": "Andrea Zapparoli Manzoni",
    "abstract": "We'll see how the new Italian legislation on State-Sponsored Trojan shed light on some problems, posed new questions, answered a series of things.. while we assist to the industrial shift from an handcrafted phase to an industrial phase. And the demand grows exponentially. What could possibly go wrong?",
    "giorno": "3",
    "orario": "15:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "EN",
    "uid": "T53",
    "data": "2016-09-03 15:30:00"
  },
  {
    "titolo": "PANDA: A New Development Attitude",
    "autore": "Gianluca Pericoli \\/ Alessio De Zotti",
    "abstract": "A NEW psychedelic set of Guidelines, Decisional&Development Patterns designed and built with all the love for DEV Teams that want definetly F**k up a Project. [Motivational&Inspirational]",
    "giorno": "3",
    "orario": "16:20:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T5",
    "data": "2016-09-03 16:20:00"
  },
  {
    "titolo": "Museo dell'Informatica Funzionante",
    "autore": "Asbesto",
    "abstract": "Presentazione delle attivita' del Museo dell'Informatica Funzionante di Palazzolo Acreide \\/ Museo Interattivo di Archeologia Informatica di Cosenza. Restauro dell'hardware, tecniche, esempi, e data recovery spinto su media obsoleti. Tante foto e tante risate! smile emoticon",
    "giorno": "3",
    "orario": "16:50:00",
    "durata": "60",
    "linea": "2",
    "lingua": "IT",
    "uid": "T18",
    "data": "2016-09-03 16:50:00"
  },
  {
    "titolo": "Incontro ravvicinato con AArch64",
    "autore": "Davide Bettio",
    "abstract": "Con la RaspberryPi 3 aarch64 é disponibile al grande pubblico, vediamo cosa c'è di nuovo e di vecchio nell'architettura ARM a 64 bit",
    "giorno": "3",
    "orario": "17:50:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T43",
    "data": "2016-09-03 17:50:00"
  },
  {
    "titolo": "Functional Programming Without a Functional Language",
    "autore": "Meredith L. Patterson",
    "abstract": "Functional languages have given rise to many powerful idioms, like parser combinators and iteratees, for managing the flow of data. What's a developer stuck with a procedural language to do? Never fear  a sufficiently stubborn programmer can implement functional idioms in any language. In this talk, we'll explore the internals of Hammer, an experimental parser combinator library, which targets context-sensitive, context-free, and regular parsing backends and is written in C. We'll also look at nom, which combines Hammer's approach with Rust's macro system to produce blindingly fast parsers. Finally, we'll talk about the security benefits of functional input handling with a real-world case study drawn from the world of industrial control systems.",
    "giorno": "3",
    "orario": "21:30:00",
    "durata": "60",
    "linea": "2",
    "lingua": "EN",
    "uid": "T48",
    "data": "2016-09-03 21:30:00"
  },
  {
    "titolo": "Fuk da system! Exploiting companies threw email!",
    "autore": "okno \\/ b3rito",
    "abstract": "Indagine statistica per analizzare la sicurezza sociale relativa ad organigrammi aziendali mirati. ",
    "giorno": "3",
    "orario": "23:00:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T56",
    "data": "2016-09-03 23:00:00"
  },
  {
    "titolo": "Social Engineering: Fino a che punto ci si può spingere in Italia e In Europa",
    "autore": "Omar El Hamdani",
    "abstract": "Si sente tanto parlare di Social Engineering, ma poco di quello che le aziende fanno per tutelarsi da questa tipologia di attacco. In che cosa consistono le attività svolte dalle società per testare la sicurezza aziendale in merito ad attacchi di questo tipo? Fino a che punto ci si può spingere durante una simulazione di Social Engineering e in che modo è possibile svolgerla? In questo Talk analizzeremo che cosa significhi fare Social Engineering per lavoro in Italia e in Europa e quali siano i limiti legali.",
    "giorno": "3",
    "orario": "23:30:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T9",
    "data": "2016-09-03 23:30:00"
  },
  {
    "titolo": "Unchallenged Freshness",
    "autore": "RingoBongo LTD",
    "abstract": "RingoBongo LTD Annual Report & Proxy",
    "giorno": "4",
    "orario": "00:15:00",
    "durata": "30",
    "linea": "2",
    "lingua": "IT",
    "uid": "T76",
    "data": "2016-09-04 00:15:00"
  }
]
